<template>
  <div>
    <h1>用来做测试</h1>
  </div>
</template>

<script>
export default {
  data() {
    return {
      arrOne: [
        {
          产品类型: "IP3-001",
          编号01: "ABC-001",
          编号02: "DEF-001",
        },
        {
          产品类型: "IP3-002",
          编号02: "DEF-002",
        },
        {
          产品类型: "IP3-003",
          编号02: "DEF-003",
        },
        {
          产品类型: "IP3-004",
          编号01: "ABC-004",
          编号02: "DEF-004",
        },
        {
          产品类型: "IP3-005",
          编号01: "ABC-005",
          编号02: "DEF-005",
        },
        {
          产品类型: "IP3-006",
          编号01: "ABC-006",
        },
        {
          产品类型: "IP3-007",
          编号01: "ABC-007",
        },
        {
          产品类型: "IP3-008",
          编号01: "ABC-008",
        },
        {
          产品类型: "IP3-009",
          编号01: "ABC-009",
          编号02: "DEF-009",
        },
        {
          产品类型: "IP3-010",
          编号01: "ABC-010",
          编号02: "DEF-010",
        },
      ],
      arrTwo: [
        {
          产品类型: "IP3-001",
          编号03: "GHI-001",
          编号04: "JKL-001",
        },
        {
          产品类型: "IP3-002",
          编号03: "GHI-002",
          编号04: "JKL-002",
        },
        {
          产品类型: "IP3-003",
          编号04: "JKL-003",
        },
        {
          产品类型: "IP3-004",
          编号04: "JKL-004",
        },
        {
          产品类型: "IP3-005",
          编号04: "JKL-005",
        },
        {
          产品类型: "IP3-011",
          编号03: "GHI-006",
          编号04: "JKL-006",
        },
        {
          产品类型: "IP3-012",
          编号03: "GHI-007",
        },
        {
          产品类型: "IP3-013",
          编号03: "GHI-008",
        },
        {
          产品类型: "IP3-014",
          编号03: "GHI-009",
        },
        {
          产品类型: "IP3-015",
          编号03: "GHI-010",
          编号04: "JKL-010",
        },
      ],
    }
    
  },
  mounted(){
    // let arr=this.arrOne.concat(this.arrTwo)
    //   // 先判断产品类型是否相等，相等的话找到这俩个对象合并去重，判断长度，补齐四个，没有值的话，为underfind
    // })
    let arr=this.arrOne.map(item1=>{
      let arrtwo=this.arrTwo.find(item2=>item1.产品类型===item2.产品类型)
      return {...item1,...arrtwo,}
    })
    console.log(arr);
  },
  methods:{

  }
};
</script>

<style>
</style>